1c/standalone/src/InformationRegisters/Кабиторий_ИсходящиеНамерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Кабиторий_ИсходящиеНамерения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>d5p1:DocumentRef.Кабиторий_ОказаниеУслуги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЭффекта</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.Кабиторий_ВидыИсходящихЭффектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.Кабиторий_СостоянияНамерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Попыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Создано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СледующаяПопытка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолезнаяНагрузка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КлючИдемпотентности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c/standalone/src/Enums/Кабиторий_СостоянияНамерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Кабиторий_СостоянияНамерения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетРазбора</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1c/standalone/src/CommonModules/Кабиторий_ИсходящиеЭффекты/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обрабатывает одно исходящее намерение (исполнитель Outbox, §20, INV-10).
// Три такта: пометить ВОбработке (короткая транзакция) -> вызвать SPI ВНЕ
// транзакции -> зафиксировать успех/ошибку (короткая транзакция). При исчерпании
// попыток намерение помечается «требует разбора».
//
// Параметры:
//   Ключ - Строка - ключ идемпотентности намерения
//
Процедура ОбработатьНамерение(Ключ) Экспорт

	Реестр = РегистрыСведений.Кабиторий_ИсходящиеНамерения;

	Намерение = Реестр.ПолучитьНамерение(Ключ);
	Если Намерение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ГотовоКОбработке(Намерение.Состояние) Тогда
		Возврат;
	КонецЕсли;

	Реестр.ОтметитьВОбработке(Ключ);

	// Вызов наружу - ВНЕ транзакции (INV-10). Исключение коннектора трактуем как отказ.
	Попытка
		Ответ = Кабиторий_ИнтеграцияИсполнение.ВыполнитьЭффект(Намерение);
	Исключение
		Ответ = Кабиторий_ИнтеграцияИсполнение.НовыйОтвет();
		Ответ.reasonCode = "EXCEPTION";
		Ответ.reasonDescription = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Если Ответ.success Тогда
		Реестр.ЗафиксироватьУспех(Ключ, Ответ.externalRef);
	Иначе
		ОбработатьОтказ(Ключ, Намерение, Ответ);
	КонецЕсли;

КонецПроцедуры

// Обрабатывает готовые к отправке намерения (fallback-регламент / фоновый дренаж).
//
// Параметры:
//   Максимум - Число - ограничение пачки
//
// Возвращаемое значение:
//   Число - сколько намерений обработано
//
Функция ОбработатьГотовые(Максимум = 100) Экспорт

	Ключи = РегистрыСведений.Кабиторий_ИсходящиеНамерения.ВыбратьГотовыеКОбработке(Максимум);

	Для Каждого Ключ Из Ключи Цикл
		ОбработатьНамерение(Ключ);
	КонецЦикла;

	Возврат Ключи.Количество();

КонецФункции

// Точка входа фонового/регламентного задания: дренирует очередь Outbox.
//
Процедура ФоновоеЗаданиеОбработкаГотовых() Экспорт

	ОбработатьГотовые();

КонецПроцедуры

// Запускает фоновую обработку очереди, если нет активной транзакции (такт 2, §20).
// Вызывать ПОСЛЕ коммита доменной транзакции: иначе фоновое в изолированном
// сеансе не увидит ещё не зафиксированных намерений.
//
Процедура ЗапуститьОбработкуФоном() Экспорт

	Если ТранзакцияАктивна() Тогда
		Возврат;
	КонецЕсли;

	ФоновыеЗадания.ВыполнитьВФоне(
		"Кабиторий_ИсходящиеЭффекты.ФоновоеЗаданиеОбработкаГотовых",
		Новый Массив,
		,
		"Кабиторий: обработка Outbox");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обрабатывает отказ коннектора: фиксирует ошибку с переносом следующей попытки;
// при исчерпании попыток помечает «требует разбора» (эскалация заявки - TODO).
//
// Параметры:
//   Ключ - Строка - ключ идемпотентности
//   Намерение - Структура - намерение до фиксации отказа
//   Ответ - Структура - ответ SPI с reasonCode/reasonDescription
//
Процедура ОбработатьОтказ(Ключ, Намерение, Ответ)

	Реестр = РегистрыСведений.Кабиторий_ИсходящиеНамерения;
	НомерПопытки = Намерение.Попыток + 1;

	Реестр.ЗафиксироватьОшибку(Ключ, Ответ.reasonCode, Ответ.reasonDescription,
		ЗадержкаПовтораСек(НомерПопытки));

	Если НомерПопытки >= МаксПопыток() Тогда
		Реестр.ПометитьТребуетРазбора(Ключ,
			"Исчерпаны попытки (" + Формат(НомерПопытки, "ЧГ=0") + "): " + Ответ.reasonDescription);
		// TODO: эскалация заявки - блок «требует разбора» + оповещение (§6.2/§6.3).
	КонецЕсли;

КонецПроцедуры

// Готово ли намерение к (повторной) обработке.
//
// Параметры:
//   Состояние - EnumRef.Кабиторий_СостоянияНамерения
//
// Возвращаемое значение:
//   Булево
//
Функция ГотовоКОбработке(Состояние)

	Состояния = Перечисления.Кабиторий_СостоянияНамерения;
	Возврат Состояние = Состояния.Новое Или Состояние = Состояния.Ошибка;

КонецФункции

// Максимум попыток отправки. ПРОВИЗОРНОЕ значение; политика повторов - TBD (§20).
//
// Возвращаемое значение:
//   Число
//
Функция МаксПопыток()

	Возврат 5;

КонецФункции

// Задержка до следующей попытки, сек: экспонента от базовой. ПРОВИЗОРНО; TBD (§20).
//
// Параметры:
//   НомерПопытки - Число - номер только что сделанной попытки (с 1)
//
// Возвращаемое значение:
//   Число - секунды до следующей попытки
//
Функция ЗадержкаПовтораСек(НомерПопытки)

	БазоваяЗадержка = 60;

	Множитель = 1;
	Для Сч = 1 По НомерПопытки - 1 Цикл
		Множитель = Множитель * 2;
	КонецЦикла;

	Возврат БазоваяЗадержка * Множитель;

КонецФункции

#КонецОбласти
